In [9]:
from sqlalchemy import create_engine, text
import pandas as pd

In [21]:
engine = create_engine('sqlite:///./sql-murder-mystery.db')

In [22]:
query = """ 
SELECT *
FROM sqlite_master
where type = "table"

"""

pd.read_sql(query,con=engine)

,type,name,tbl_name,rootpage,sql
0,table,crime_scene_report,crime_scene_report,2,CREATE TABLE crime_scene_report (\n dat...
1,table,drivers_license,drivers_license,3,CREATE TABLE drivers_license (\n id int...
2,table,person,person,4,CREATE TABLE person (\n id integer PRIM...
3,table,facebook_event_checkin,facebook_event_checkin,5,CREATE TABLE facebook_event_checkin (\n ...
4,table,interview,interview,6,CREATE TABLE interview (\n person_id in...
5,table,get_fit_now_member,get_fit_now_member,7,CREATE TABLE get_fit_now_member (\n id ...
6,table,get_fit_now_check_in,get_fit_now_check_in,9,CREATE TABLE get_fit_now_check_in (\n m...
7,table,income,income,10,CREATE TABLE income (\n ssn integer PRI...
8,table,solution,solution,11,"CREATE TABLE solution (\n user integer,..."

In [29]:
query = """ 
SELECT description
FROM crime_scene_report
where description LIKE "Security%"
"""

desc1 = pd.read_sql(query,con=engine)
desc1.loc[:,"description"][0]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

In [38]:
query = """
SELECT *
FROM person
WHERE address_street_name = "Northwestern Dr" 


"""
num = pd.read_sql(query,con=engine)
num.loc[2,:]

id                               14887
name                    Morty Schapiro
license_id                      118009
address_number                    4919
address_street_name    Northwestern Dr
ssn                          111564949
Name: 2, dtype: object

In [42]:
query = """
SELECT *
FROM person
WHERE name LIKE "Annabel%"


"""
nom = pd.read_sql(query,con=engine)
nom.loc[0,:]

id                              16371
name                   Annabel Miller
license_id                     490173
address_number                    103
address_street_name      Franklin Ave
ssn                         318771143
Name: 0, dtype: object

In [54]:
query = """ 
SELECT *
FROM interview
WHERE person_id = 16371 or person_id = 14887
"""

wit = pd.read_sql(query,con=engine)
wit1 = wit.loc[0,"transcript"]
wit2 = wit.loc[1,"transcript"]
wit1

'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'

In [55]:
wit2

'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.'

In [59]:
query = """ 
SELECT *
FROM drivers_license
Where plate_number like "%H42W%"
"""

pd.read_sql(query,con=engine)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

In [68]:
query = """ 
SELECT *
FROM get_fit_now_member	
where membership_status = "gold" and id like "48Z%"
"""

pd.read_sql(query,con=engine)

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [70]:
query = """ 
SELECT *
FROM get_fit_now_check_in
WHERE check_in_date = "20180109" and membership_id like "48Z%"

"""
pd.read_sql(query,con=engine)

  membership_id  check_in_date  check_in_time  check_out_time
0         48Z7A       20180109           1600            1730
1         48Z55       20180109           1530            1700

In [76]:
query = """ 
SELECT *
FROM person
Where license_id like "423327"

"""
pd.read_sql(query,con=engine)

,id,name,license_id,address_number,address_street_name,ssn
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279